{"data":{"job":{"pageTitle":"Product Manager","content":"<p><strong>Status</strong>: Full-time; one-year grant-funded position with possibility for an extension</p>\n<p><strong>Location</strong>: Remote</p>\n<p><strong>Salary/Benefits</strong>: $70,000 and eligible for benefits</p>\n<p>If you want to help aspiring news entrepreneurs serve their local communities across the U.S., this job is for you.</p>\n<p>LION, News Catalyst, and other soon-to-be-announced partners are joining to launch a new project that will support local news founders, who have been historically shut out of media ownership.</p>\n<p>To help us round out the team, we are hiring a product manager who will create and execute the onboarding and training of founders. This position will live on LION’s team while reporting to deputy director Anika Anand, and will work very closely with <a href=\"https://newscatalyst.org/about/\">the News Catalyst team</a> and other partners.</p>\n<p>Our team believes when everyone can participate in creating relevant, accurate and culturally competent local news and information, everyone can more fully engage in civic life, make more informed decisions, and better understand the world around them. If you’re interested in helping us make this vision a reality, learn more about the job and how to apply below.</p>\n<p>This position will require someone who is excellent at making complicated materials accessible, extremely collaborative and can juggle multiple stakeholders across two organizations. The strongest candidate for this position will be someone who is eager to help us build from the ground up.</p>\n<p>We plan to announce more details about this project in the coming weeks, and will share more about our vision with applicants we select to interview.</p>\n<p><strong>Here’s some of the work we’d love your help with:</strong></p>\n<ul>\n<li>Work with the development team to create documentation and training on how to use the project’s resources and train participants</li>\n<li>Work closely with the GNI Startups Lab Program Manager to design training on how to launch a local news business that aligns with our project’s product stack</li>\n<li>Ensure that all documentation and training can be accessible to those without formal journalism training</li>\n<li>Serve as a liaison between the publishers and project team on how to iterate and improve the trainings and product stack over time</li>\n<li>Help create a system to receive feedback, requests from and deliver customer support  to the publishers</li>\n</ul>\n<p><strong>You should also be prepared to work for a team that’s:</strong></p>\n<ul>\n<li>Prioritizing the needs of those who have been underrepresented in traditional media</li>\n<li>Agile, scrappy and operates leanly</li>\n<li>Distributed across time zones and relies heavily on digital communication to communicate and collaborate with each other</li>\n</ul>\n<p><strong>Here’s more on how to apply:</strong>\nIf you choose to apply, and are chosen to be interviewed, be prepared to talk about your mid-term and long-term career goals and how working on this project  can help support you in achieving them; how you hope to grow this role; and what you, specifically, can contribute to a vision to helping support more aspiring news entrepreneurs.</p>\n<p>Submit your application <a href=\"https://airtable.com/shr3wadwnJitjWp69\">using this form</a> by Nov. 17, 2020.</p>\n<p>We ask that you provide:</p>\n<ul>\n<li>Your resume</li>\n<li>Any online links that show your work (a Twitter profile, a portfolio page, etc.)</li>\n</ul>\n<p>And answers to the following questions:</p>\n<ul>\n<li>Have you ever led or helped build a project from scratch? What was the project’s goal? What were the major challenges and successes and what did you learn?</li>\n<li>Tell us about a time you’ve had to create documentation and training materials for a new product. Was it successful? Why or why not? What would you have done differently?</li>\n<li>What do you think are the biggest barriers facing aspiring local news entrepreneurs?</li>\n<li>Why are you interested in working with local news entrepreneurs and how does that fit into your long-term career ambitions?</li>\n</ul>\n<p>If you have any questions, please email Anika Anand at anika@lionpublishers.com.</p>\n<hr>\n<p>LION Publishers encourages applications from diverse backgrounds and underrepresented communities. We desire to build an organization and grow a membership that welcomes and encourages participation from all interested individuals.</p>\n","slug":"product-manager","jobTitle":"Product Manager"}},"context":{}}